formattingPattern.org
#+title: Formatting Pattern
#+author: Nathan Stonewall
#+email: nathan.stonewall@gs1.se
#+date: <2023-10-05 Thu>
#+OPTIONS: H:1 num:nil author:Nathan Stonewall date:2023-09-15
# #+TOC: headlines 1

* Problem
- Community has expressed need to send **styled textual information** via GDSN.

- ~FormattedDescription~ and ~formattingPattern~ provide this, but are difficult to implement and use.

- HTML code is being used by some datapools, but:
    - Unstandardized
    - Unsafe
    - Must be escaped/unescaped
    - Not adapted to current XML modeling
-----

* Examples
*** Current TIIG framework
#+BEGIN_SRC text
formattingPattern=“(1,p),(1,em),(56,/em),(141,em),(159,/em),(214,em),(266,/em),(348,em),(362,/em),(446,em),(456,/em),(457,/p),(459,p),(459,em),(512,/em),(556,em),(578,/em),(604,em),(622,/em),(775,em),(784,/em),(806,em),(838,/em),(850,em),(886,/em),(906,em),(926,/em),(957,em),(967,/em),(969,/p) >
#+END_SRC
*** HTML
#+BEGIN_XML
<stringAVP attributeName="ingredientStatementFormattingPattern">&lt;u&gt;Stuff&lt;/u&gt;</stringAVP>
<stringAVP attributeName="ingredientStatementFormattingPattern">stuff&lt;br&gt;Ingredients: Stuff</stringAVP>
#+END_XML

* Suggested solution
** Implement [[https://www.bbcode.org/how-to-use-bbcode-a-complete-guide.php][BBCode formatting.]]
**** Simple
**** Safe
**** Flexible
**** Well-established


*** Syntax
| BBCode            | Effect                       |
|-------------------+------------------------------|
| [b]               | Bold                         |
| [i]               | Italic                       |
| [u]               | Underline                    |
| [br]              | Line break                   |
| [url]             | Insert link                  |
| [color=color]     | Change text color to {color} |
| [align=alignment] | Align text e.g. to center    |
| [list]            | Make list                    |
| [*]               | Add list item                |
|-------------------+------------------------------|

*** Example BBCode
#+BEGIN_SRC text
[b]4 X Flamin’ Hot Flavour Baked Corn Snack. Ingredients: [/b]Maize, Vegetable Oil, Flamin Hot Flavour [b]Hydrolysed Soya Protein[/b], [i]Fructose[/i], Flavourings ...
#+END_SRC

-----
** Suggested process:
***** Service providers implement rich-text editors in their GUIs, or ...
***** End users fill in TII, by hand.
***** DP forwards TII to recipient
***** Recipient decides how or whether to handle styled TII

* Considerations
***** Limit complexity: Agree on allowed subset of BBCode.
***** Modeling: Replace ~formattingPattern~, ~sequenceNumber~?
***** Validations: For all styled text, ensure recipients get same text unstyled.
